Revit 2027 API
RoutingCriterionBase.IsEqual Method
 Verify if two criteria are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	RoutingCriterionBase pOther
)
Public Function IsEqual (
	pOther As RoutingCriterionBase
) As Boolean
public:
bool IsEqual(
	RoutingCriterionBase^ pOther
)
member IsEqual :
        pOther : RoutingCriterionBase -> bool
Parameters
pOther RoutingCriterionBase
Return Value
Boolean
 True if the criterion is equal to the other, false otherwise
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace